liuhuihou/projects/2026H/Hproject/config/board.syscfg
/**
 * H题 - 车载平衡滚球运动控制系统
 * S28A + C07A hardware configuration.
 *
 * Generated for MSPM0G350X, LQFP-64(PM), MSPM0 SDK 2.01.00.03.
 * Pin assignments are identical to the reference line-follower project,
 * with addition of stepper motor control pins (PB12, PB13, PB4).
 */
// @cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default"
// @cliArgs --board /ti/boards/LP_MSPM0G3507 --rtos nortos

const GPIO = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1 = GPIO.addInstance();
const GPIO2 = GPIO.addInstance();
const GPIO3 = GPIO.addInstance();
const GPIO4 = GPIO.addInstance();
const GPIO5 = GPIO.addInstance();
const GPIO6 = GPIO.addInstance();
const GPIO7 = GPIO.addInstance();
const GPIO8 = GPIO.addInstance();
const GPIO9 = GPIO.addInstance();
const GPIO10 = GPIO.addInstance();
const GPIO11 = GPIO.addInstance();

const PWM = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1 = PWM.addInstance();

const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");
const SYSTICK = scripting.addModule("/ti/driverlib/SYSTICK");

const TIMER = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1 = TIMER.addInstance();

const UART = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1 = UART.addInstance();
const UART2 = UART.addInstance();
const UART3 = UART.addInstance();

const I2C = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1 = I2C.addInstance();

const ADC12 = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121 = ADC12.addInstance();

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

/* ====================== GPIO Config ====================== */

/* BLS key on C07A: active HIGH when pressed */
GPIO1.$name = "KEY";
GPIO1.associatedPins[0].$name = "BLS";
GPIO1.associatedPins[0].direction = "INPUT";
GPIO1.associatedPins[0].internalResistor = "PULL_DOWN";
GPIO1.associatedPins[0].pin.$assign = "PA18";

/* S28A board button (active LOW) */
GPIO2.$name = "S28A_BUTTON";
GPIO2.associatedPins[0].$name = "S28A_KEY";
GPIO2.associatedPins[0].direction = "INPUT";
GPIO2.associatedPins[0].internalResistor = "PULL_UP";
GPIO2.associatedPins[0].pin.$assign = "PB8";

/* Status LED */
GPIO3.$name = "LED";
GPIO3.associatedPins[0].$name = "led";
GPIO3.associatedPins[0].pin.$assign = "PB9";

/* TB6612 Motor A direction: AIN1=PA14, AIN2=PA13 */
GPIO4.$name = "MOTOR_A_DIR";
GPIO4.port = "PORTA";
GPIO4.associatedPins.create(2);
GPIO4.associatedPins[0].$name = "AIN1";
GPIO4.associatedPins[0].pin.$assign = "PA14";
GPIO4.associatedPins[1].$name = "AIN2";
GPIO4.associatedPins[1].pin.$assign = "PA13";

/* TB6612 Motor B direction: BIN1=PA16, BIN2=PA17 */
GPIO5.$name = "MOTOR_B_DIR";
GPIO5.port = "PORTA";
GPIO5.associatedPins.create(2);
GPIO5.associatedPins[0].$name = "BIN1";
GPIO5.associatedPins[0].pin.$assign = "PA16";
GPIO5.associatedPins[1].$name = "BIN2";
GPIO5.associatedPins[1].pin.$assign = "PA17";

/* Encoder A: E1A=PA25, E1B=PA26 (GPIO interrupt, both edges) */
GPIO6.$name = "ENCODERA";
GPIO6.port = "PORTA";
GPIO6.associatedPins.create(2);
GPIO6.associatedPins[0].$name = "E1A";
GPIO6.associatedPins[0].direction = "INPUT";
GPIO6.associatedPins[0].interruptEn = true;
GPIO6.associatedPins[0].polarity = "RISE_FALL";
GPIO6.associatedPins[0].pin.$assign = "PA25";
GPIO6.associatedPins[1].$name = "E1B";
GPIO6.associatedPins[1].direction = "INPUT";
GPIO6.associatedPins[1].interruptEn = true;
GPIO6.associatedPins[1].polarity = "RISE_FALL";
GPIO6.associatedPins[1].pin.$assign = "PA26";

/* Encoder B: E2A=PB20, E2B=PB24 (GPIO interrupt, both edges) */
GPIO7.$name = "ENCODERB";
GPIO7.port = "PORTB";
GPIO7.associatedPins.create(2);
GPIO7.associatedPins[0].$name = "E2A";
GPIO7.associatedPins[0].direction = "INPUT";
GPIO7.associatedPins[0].interruptEn = true;
GPIO7.associatedPins[0].polarity = "RISE_FALL";
GPIO7.associatedPins[0].pin.$assign = "PB20";
GPIO7.associatedPins[1].$name = "E2B";
GPIO7.associatedPins[1].direction = "INPUT";
GPIO7.associatedPins[1].interruptEn = true;
GPIO7.associatedPins[1].polarity = "RISE_FALL";
GPIO7.associatedPins[1].pin.$assign = "PB24";
/* OLED: RST=PB14, DC=PB15, SCL=PA28, SDA=PA31 (software SPI) */
GPIO8.$name = "OLED";
GPIO8.associatedPins.create(4);
GPIO8.associatedPins[0].$name = "RST";
GPIO8.associatedPins[0].pin.$assign = "PB14";
GPIO8.associatedPins[1].$name = "DC";
GPIO8.associatedPins[1].pin.$assign = "PB15";
GPIO8.associatedPins[2].$name = "SCL";
GPIO8.associatedPins[2].pin.$assign = "PA28";
GPIO8.associatedPins[3].$name = "SDA";
GPIO8.associatedPins[3].pin.$assign = "PA31";

/* MPU6050 INT pin */
GPIO9.$name = "MPU6050_INT";
GPIO9.associatedPins[0].$name = "INT";
GPIO9.associatedPins[0].direction = "INPUT";
GPIO9.associatedPins[0].pin.$assign = "PA7";

/* IR Line Sensors (6-channel) */
GPIO10.$name = "IR_SENSORS";
GPIO10.associatedPins.create(6);
GPIO10.associatedPins[0].$name = "IR1";
GPIO10.associatedPins[0].direction = "INPUT";
GPIO10.associatedPins[0].pin.$assign = "PA22";
GPIO10.associatedPins[1].$name = "IR2";
GPIO10.associatedPins[1].direction = "INPUT";
GPIO10.associatedPins[1].pin.$assign = "PA24";
GPIO10.associatedPins[2].$name = "IR3";
GPIO10.associatedPins[2].direction = "INPUT";
GPIO10.associatedPins[2].pin.$assign = "PA27";
GPIO10.associatedPins[3].$name = "IR4";
GPIO10.associatedPins[3].direction = "INPUT";
GPIO10.associatedPins[3].pin.$assign = "PA9";
GPIO10.associatedPins[4].$name = "IR5";
GPIO10.associatedPins[4].direction = "INPUT";
GPIO10.associatedPins[4].pin.$assign = "PA12";
GPIO10.associatedPins[5].$name = "IR6";
GPIO10.associatedPins[5].direction = "INPUT";
GPIO10.associatedPins[5].pin.$assign = "PB16";

/* Stepper Motor: STEP=PB12, DIR=PB13, EN=PB4 */
GPIO11.$name = "STEPPER";
GPIO11.associatedPins.create(3);
GPIO11.associatedPins[0].$name = "STEP";
GPIO11.associatedPins[0].pin.$assign = "PB12";
GPIO11.associatedPins[1].$name = "DIR";
GPIO11.associatedPins[1].pin.$assign = "PB13";
GPIO11.associatedPins[2].$name = "EN";
GPIO11.associatedPins[2].pin.$assign = "PB4";

/* ====================== PWM Config ====================== */

/* Motor PWM: TIMA1, 10kHz, 2 channels */
PWM1.$name = "PWM_0";
PWM1.timerCount = 8000;
PWM1.peripheral.$assign = "TIMA1";
PWM1.peripheral.ccp0Pin.$assign = "PB2";
PWM1.peripheral.ccp1Pin.$assign = "PB3";

/* ====================== Timer Config ====================== */

/* Control loop timer: TIMG0, 10ms periodic, auto-start */
TIMER1.$name = "TIMER_0";
TIMER1.timerClkPrescale = 32;
TIMER1.timerMode = "PERIODIC";
TIMER1.timerStartTimer = true;
TIMER1.interrupts = ["ZERO"];
TIMER1.timerPeriod = "10 ms";
TIMER1.peripheral.$assign = "TIMG0";

/* ====================== SYSCTL Config ====================== */
SYSCTL.forceDefaultClkConfig = true;

/* ====================== UART Config ====================== */

/* USB Debug: UART0, 115200 */
UART1.$name = "USB";
UART1.targetBaudRate = 115200;
UART1.peripheral.$assign = "UART0";
UART1.peripheral.rxPin.$assign = "PA11";
UART1.peripheral.txPin.$assign = "PA10";

/* Bluetooth: UART1, 9600 */
UART2.$name = "BLUETOOTH";
UART2.targetBaudRate = 9600;
UART2.enableFIFO = true;
UART2.peripheral.$assign = "UART1";
UART2.peripheral.rxPin.$assign = "PB7";
UART2.peripheral.txPin.$assign = "PB6";

/* K230D Camera: UART2, 115200 */
UART3.$name = "K230";
UART3.targetBaudRate = 115200;
UART3.enableFIFO = true;
UART3.peripheral.$assign = "UART2";
UART3.peripheral.rxPin.$assign = "PB18";
UART3.peripheral.txPin.$assign = "PB17";

/* ====================== I2C Config ====================== */

/* MPU6050: I2C0, SDA=PA0, SCL=PA1, 100kHz */
I2C1.$name = "I2C_MPU";
I2C1.basicEnableController = true;
I2C1.basicControllerStandardBusSpeed = "Standard";
I2C1.peripheral.$assign = "I2C0";
I2C1.peripheral.sdaPin.$assign = "PA0";
I2C1.peripheral.sclPin.$assign = "PA1";

/* ====================== ADC Config ====================== */

/* Battery voltage: ADC1 CH0, PA15 */
ADC121.$name = "BATTERY_ADC";
ADC121.sampClkSrc = "DL_ADC12_CLOCK_ULPCLK";
ADC121.sampClkDiv = "DL_ADC12_CLOCK_DIVIDE_8";
ADC121.adcMem0chansel = "DL_ADC12_INPUT_CHAN_0";
ADC121.sampleTime0 = "125 us";
ADC121.peripheral.$assign = "ADC1";
ADC121.peripheral.adcPin0.$assign = "PA15";

/* ====================== Debug Config ====================== */
Board.peripheral.$assign = "DEBUGSS";
Board.peripheral.swclkPin.$assign = "PA20";
Board.peripheral.swdioPin.$assign = "PA19";
